// Використання бібліотеки multer для завантаження файлів
import multer from 'multer';
import { TEMP_UPLOAD_DIR } from '../constants/index.js';

// Налаштування що дозволяють зберігати завантажені файли у визначеній директорії з унікальними іменами, що забезпечить організоване та безпечне управління файлами на сервері.
const storage = multer.diskStorage({
  // Цей параметр визначає, в яку директорію будуть зберігатися завантажені файли. Він реалізований як функція, яка отримує три аргументи: запит (req), файл (file) і функцію зворотного виклику (cb). Функція зворотного виклику використовується для передачі директорії, в яку слід зберегти файл. У даному випадку, цю директорію ми визначии заздалегідь у константі TEMP_UPLOAD_DIR, що вказує на тимчасову директорію для завантажень.
  destination: function (req, file, cb) {
    cb(null, TEMP_UPLOAD_DIR);
  },
  // Цей параметр визначає, яке ім'я буде надане завантаженому файлу. Він також реалізований як функція з трьома аргументами: запит (req), файл (file) і функція зворотного виклику (cb). Щоб уникнути конфліктів між файлами з однаковими іменами, до оригінального імені файлу додамо унікальний суфікс. Цей суфікс створюється за допомогою поточної дати і часу у мілісекундах, що гарантує унікальність кожного імені файлу.
  filename: function (req, file, cb) {
    const uniqueSuffix = Date.now();
    cb(null, `${uniqueSuffix}_${file.originalname}`);
  },
});

export const upload = multer({ storage });
